#### Terraform dev Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.media_api.data.archive_file.media_uploads: Reading...
module.media_api.data.archive_file.device_tokens: Reading...
module.media_api.data.archive_file.push_notification: Reading...
module.media_api.data.archive_file.push_notification: Read complete after 0s [id=74d9fe962b8c0655412817ea07799b9fbb32fe37]
module.media_api.data.archive_file.device_tokens: Read complete after 0s [id=b331e936e859c0992ea2f3ac9ae6a83c49bc4aa6]
module.media_api.data.archive_file.media_uploads: Read complete after 0s [id=9be5228a35273930ad39ee3aff0d77351761e4e1]
module.identity_pool.data.aws_region.current: Reading...
module.media_api.aws_cloudwatch_log_group.lambda["create_upload_record"]: Refreshing state... [id=/aws/lambda/cloud-photos-dev-create-upload-record]
module.media_api.aws_cloudwatch_log_group.lambda["delete_upload_record"]: Refreshing state... [id=/aws/lambda/cloud-photos-dev-delete-upload-record]
module.media_api.aws_iam_role.create_upload_record: Refreshing state... [id=cloud-photos-dev-create-upload-record-role]
module.media_api.data.aws_caller_identity.current: Reading...
module.media_db.aws_dynamodb_table.upload_records: Refreshing state... [id=cloud-photos-upload-records-dev]
module.media_api.aws_cloudwatch_log_group.lambda["unregister_device_token"]: Refreshing state... [id=/aws/lambda/cloud-photos-dev-unregister-device-token]
module.media_api.aws_iam_role.notify_upload_complete: Refreshing state... [id=cloud-photos-dev-notify-upload-complete-role]
module.media_api.aws_iam_role.get_upload_records: Refreshing state... [id=cloud-photos-dev-get-upload-records-role]
module.cognito.aws_cognito_user_pool.main: Refreshing state... [id=ap-northeast-1_MqADoAEeB]
module.identity_pool.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.media_api.aws_cloudwatch_log_group.lambda["get_upload_records"]: Refreshing state... [id=/aws/lambda/cloud-photos-dev-get-upload-records]
module.media_api.data.aws_caller_identity.current: Read complete after 0s [id=***]
module.media_api.aws_cloudwatch_log_group.lambda["notify_upload_complete"]: Refreshing state... [id=/aws/lambda/cloud-photos-dev-notify-upload-complete]
module.media_api.aws_cloudwatch_log_group.lambda["register_device_token"]: Refreshing state... [id=/aws/lambda/cloud-photos-dev-register-device-token]
module.media_api.data.aws_region.current: Reading...
module.media_api.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.media_api.aws_iam_role.delete_upload_record: Refreshing state... [id=cloud-photos-dev-delete-upload-record-role]
module.media_storage.data.aws_caller_identity.current: Reading...
module.media_storage.data.aws_caller_identity.current: Read complete after 0s [id=***]
module.media_api.aws_iam_role.unregister_device_token: Refreshing state... [id=cloud-photos-dev-unregister-device-token-role]
module.push_notification.aws_secretsmanager_secret.firebase_credentials: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-1:***:secret:cloud-photos-firebase-credentials-dev-6QpS59]
module.media_api.aws_api_gateway_rest_api.media: Refreshing state... [id=vtz8vfq85g]
module.device_token_db.aws_dynamodb_table.device_tokens: Refreshing state... [id=cloud-photos-device-tokens-dev]
module.push_notification.aws_lambda_layer_version.firebase_admin: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:***:layer:cloud-photos-firebase-admin-dev:2]
module.media_api.aws_iam_role.register_device_token: Refreshing state... [id=cloud-photos-dev-register-device-token-role]
module.cognito.aws_cognito_user_pool_client.main: Refreshing state... [id=3uf318v7h781gvs5rbrf7af932]
module.media_storage.aws_s3_bucket.media: Refreshing state... [id=***-cloud-photos-media-dev]
module.media_api.aws_iam_role_policy.get_upload_records_logs: Refreshing state... [id=cloud-photos-dev-get-upload-records-role:cloudwatch-logs]
module.media_api.aws_iam_role_policy.delete_upload_record_logs: Refreshing state... [id=cloud-photos-dev-delete-upload-record-role:cloudwatch-logs]
module.media_api.aws_iam_role_policy.notify_upload_complete_logs: Refreshing state... [id=cloud-photos-dev-notify-upload-complete-role:cloudwatch-logs]
module.media_api.aws_iam_role_policy.create_upload_record_logs: Refreshing state... [id=cloud-photos-dev-create-upload-record-role:cloudwatch-logs]
module.media_api.aws_iam_role_policy.unregister_device_token_logs: Refreshing state... [id=cloud-photos-dev-unregister-device-token-role:cloudwatch-logs]
module.media_api.aws_iam_role_policy.register_device_token_logs: Refreshing state... [id=cloud-photos-dev-register-device-token-role:cloudwatch-logs]
module.identity_pool.aws_cognito_identity_pool.main: Refreshing state... [id=ap-northeast-1:23316fc9-592e-4a7b-9a8a-c33a446faf78]
module.media_api.aws_iam_role_policy.notify_upload_complete_secrets: Refreshing state... [id=cloud-photos-dev-notify-upload-complete-role:secretsmanager-get]
module.media_api.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-vtz8vfq85g-DEFAULT_5XX]
module.media_api.aws_api_gateway_resource.media: Refreshing state... [id=eh1ehu]
module.media_api.aws_api_gateway_resource.devices: Refreshing state... [id=ug09di]
module.media_api.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-vtz8vfq85g-DEFAULT_4XX]
module.media_api.aws_iam_role_policy.delete_upload_record_dynamodb: Refreshing state... [id=cloud-photos-dev-delete-upload-record-role:dynamodb-delete]
module.media_api.aws_iam_role_policy.get_upload_records_dynamodb: Refreshing state... [id=cloud-photos-dev-get-upload-records-role:dynamodb-query]
module.media_api.aws_iam_role_policy.create_upload_record_dynamodb: Refreshing state... [id=cloud-photos-dev-create-upload-record-role:dynamodb-put]
module.media_api.aws_lambda_function.get_upload_records: Refreshing state... [id=cloud-photos-dev-get-upload-records]
module.media_api.aws_lambda_function.delete_upload_record: Refreshing state... [id=cloud-photos-dev-delete-upload-record]
module.media_api.aws_lambda_function.create_upload_record: Refreshing state... [id=cloud-photos-dev-create-upload-record]
module.media_api.aws_api_gateway_resource.devices_token: Refreshing state... [id=jw29id]
module.media_api.aws_api_gateway_resource.uploads: Refreshing state... [id=v3prx5]
module.identity_pool.aws_iam_role.authenticated: Refreshing state... [id=cloud-photos-cognito-authenticated-dev]
module.media_api.aws_iam_role_policy.register_device_token_dynamodb: Refreshing state... [id=cloud-photos-dev-register-device-token-role:dynamodb-update]
module.media_api.aws_iam_role_policy.unregister_device_token_dynamodb: Refreshing state... [id=cloud-photos-dev-unregister-device-token-role:dynamodb-delete]
module.media_api.aws_lambda_function.register_device_token: Refreshing state... [id=cloud-photos-dev-register-device-token]
module.media_api.aws_iam_role_policy.notify_upload_complete_dynamodb: Refreshing state... [id=cloud-photos-dev-notify-upload-complete-role:dynamodb-query-delete]
module.media_api.aws_lambda_function.notify_upload_complete: Refreshing state... [id=cloud-photos-dev-notify-upload-complete]
module.media_api.aws_lambda_function.unregister_device_token: Refreshing state... [id=cloud-photos-dev-unregister-device-token]
module.media_api.aws_api_gateway_method.delete_devices_token: Refreshing state... [id=agm-vtz8vfq85g-jw29id-DELETE]
module.media_api.aws_api_gateway_method.options_devices_token: Refreshing state... [id=agm-vtz8vfq85g-jw29id-OPTIONS]
module.media_api.aws_api_gateway_method.put_devices_token: Refreshing state... [id=agm-vtz8vfq85g-jw29id-PUT]
module.media_api.aws_api_gateway_method.get_uploads: Refreshing state... [id=agm-vtz8vfq85g-v3prx5-GET]
module.media_api.aws_api_gateway_resource.upload_item: Refreshing state... [id=xbfdej]
module.media_api.aws_api_gateway_method.options_uploads: Refreshing state... [id=agm-vtz8vfq85g-v3prx5-OPTIONS]
module.media_api.aws_api_gateway_resource.uploads_complete: Refreshing state... [id=lnpos6]
module.media_api.aws_api_gateway_method.post_uploads: Refreshing state... [id=agm-vtz8vfq85g-v3prx5-POST]
module.identity_pool.aws_iam_role_policy.authenticated_api: Refreshing state... [id=cloud-photos-cognito-authenticated-dev:media-api-access]
module.identity_pool.aws_cognito_identity_pool_roles_attachment.main: Refreshing state... [id=ap-northeast-1:23316fc9-592e-4a7b-9a8a-c33a446faf78]
module.media_api.aws_api_gateway_integration.options_devices_token: Refreshing state... [id=agi-vtz8vfq85g-jw29id-OPTIONS]
module.media_api.aws_api_gateway_method_response.options_devices_token: Refreshing state... [id=agmr-vtz8vfq85g-jw29id-OPTIONS-200]
module.media_api.aws_lambda_permission.get_uploads: Refreshing state... [id=AllowAPIGatewayInvoke]
module.media_api.aws_api_gateway_method.options_upload_item: Refreshing state... [id=agm-vtz8vfq85g-xbfdej-OPTIONS]
module.media_api.aws_api_gateway_method.delete_upload: Refreshing state... [id=agm-vtz8vfq85g-xbfdej-DELETE]
module.media_api.aws_api_gateway_integration.get_uploads: Refreshing state... [id=agi-vtz8vfq85g-v3prx5-GET]
module.media_api.aws_lambda_permission.post_uploads: Refreshing state... [id=AllowAPIGatewayInvoke]
module.media_api.aws_lambda_permission.delete_upload: Refreshing state... [id=AllowAPIGatewayInvoke]
module.media_api.aws_api_gateway_integration.options_uploads: Refreshing state... [id=agi-vtz8vfq85g-v3prx5-OPTIONS]
module.media_api.aws_api_gateway_method_response.options_uploads: Refreshing state... [id=agmr-vtz8vfq85g-v3prx5-OPTIONS-200]
module.media_api.aws_lambda_permission.put_devices_token: Refreshing state... [id=AllowAPIGatewayInvoke]
module.media_api.aws_api_gateway_integration.put_devices_token: Refreshing state... [id=agi-vtz8vfq85g-jw29id-PUT]
module.media_api.aws_lambda_permission.post_uploads_complete: Refreshing state... [id=AllowAPIGatewayInvoke]
module.media_api.aws_api_gateway_method.options_uploads_complete: Refreshing state... [id=agm-vtz8vfq85g-lnpos6-OPTIONS]
module.media_api.aws_api_gateway_method.post_uploads_complete: Refreshing state... [id=agm-vtz8vfq85g-lnpos6-POST]
module.media_api.aws_api_gateway_integration.post_uploads: Refreshing state... [id=agi-vtz8vfq85g-v3prx5-POST]
module.media_api.aws_lambda_permission.delete_devices_token: Refreshing state... [id=AllowAPIGatewayInvoke]
module.media_api.aws_api_gateway_integration.delete_devices_token: Refreshing state... [id=agi-vtz8vfq85g-jw29id-DELETE]
module.media_api.aws_api_gateway_integration_response.options_devices_token: Refreshing state... [id=agir-vtz8vfq85g-jw29id-OPTIONS-200]
module.media_api.aws_api_gateway_method_response.options_upload_item: Refreshing state... [id=agmr-vtz8vfq85g-xbfdej-OPTIONS-200]
module.media_api.aws_api_gateway_integration.options_upload_item: Refreshing state... [id=agi-vtz8vfq85g-xbfdej-OPTIONS]
module.media_api.aws_api_gateway_integration.delete_upload: Refreshing state... [id=agi-vtz8vfq85g-xbfdej-DELETE]
module.media_api.aws_api_gateway_integration_response.options_uploads: Refreshing state... [id=agir-vtz8vfq85g-v3prx5-OPTIONS-200]
module.media_api.aws_api_gateway_method_response.options_uploads_complete: Refreshing state... [id=agmr-vtz8vfq85g-lnpos6-OPTIONS-200]
module.media_api.aws_api_gateway_integration.options_uploads_complete: Refreshing state... [id=agi-vtz8vfq85g-lnpos6-OPTIONS]
module.media_api.aws_api_gateway_integration.post_uploads_complete: Refreshing state... [id=agi-vtz8vfq85g-lnpos6-POST]
module.media_api.aws_api_gateway_integration_response.options_upload_item: Refreshing state... [id=agir-vtz8vfq85g-xbfdej-OPTIONS-200]
module.media_api.aws_api_gateway_integration_response.options_uploads_complete: Refreshing state... [id=agir-vtz8vfq85g-lnpos6-OPTIONS-200]
module.media_api.aws_api_gateway_deployment.media: Refreshing state... [id=77hkh4]
module.media_api.aws_api_gateway_stage.media: Refreshing state... [id=ags-vtz8vfq85g-dev]
module.media_storage.aws_s3_bucket_versioning.media: Refreshing state... [id=***-cloud-photos-media-dev]
module.media_storage.aws_s3_bucket_public_access_block.media: Refreshing state... [id=***-cloud-photos-media-dev]
module.identity_pool.aws_iam_role_policy.authenticated_s3: Refreshing state... [id=cloud-photos-cognito-authenticated-dev:media-storage-access]
module.media_storage.aws_s3_bucket_server_side_encryption_configuration.media: Refreshing state... [id=***-cloud-photos-media-dev]
module.media_storage.aws_s3_bucket_lifecycle_configuration.media: Refreshing state... [id=***-cloud-photos-media-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.media_api.aws_api_gateway_gateway_response.default_4xx will be updated in-place
  ~ resource "aws_api_gateway_gateway_response" "default_4xx" {
        id                  = "aggr-vtz8vfq85g-DEFAULT_4XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # module.media_api.aws_api_gateway_gateway_response.default_5xx will be updated in-place
  ~ resource "aws_api_gateway_gateway_response" "default_5xx" {
        id                  = "aggr-vtz8vfq85g-DEFAULT_5XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # module.media_api.aws_lambda_function.notify_upload_complete will be updated in-place
  ~ resource "aws_lambda_function" "notify_upload_complete" {
        id                             = "cloud-photos-dev-notify-upload-complete"
      ~ last_modified                  = "2026-03-22T07:15:51.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:***:layer:cloud-photos-firebase-admin-dev:2",
        ] -> (known after apply)
      ~ source_code_hash               = "DQ0/FSkBK4IJqhoVx/XgzCuOP/tHQTPF0htddVwFM+Y=" -> "aw//IQWWzhpmsigokN8r9ZE9GDdrpzrK9ZRANu2qxKw="
        tags                           = {}
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.push_notification.aws_lambda_layer_version.firebase_admin must be replaced
+/- resource "aws_lambda_layer_version" "firebase_admin" {
      ~ arn                         = "arn:aws:lambda:ap-northeast-1:***:layer:cloud-photos-firebase-admin-dev:2" -> (known after apply)
      ~ code_sha256                 = "2JSjndKjTIR0WIacYzxwx10ELeQEwDgk3cS/nlGZPMU=" -> (known after apply)
      ~ created_date                = "2026-03-22T07:15:50.511+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-northeast-1:***:layer:cloud-photos-firebase-admin-dev:2" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-northeast-1:***:layer:cloud-photos-firebase-admin-dev" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "2JSjndKjTIR0WIacYzxwx10ELeQEwDgk3cS/nlGZPMU=" -> "83XOgi/hiqGd/CBrfj5uW3fv7vQKETBQ6ROIZLeJ3n8=" # forces replacement
      ~ source_code_size            = 20722190 -> (known after apply)
      ~ version                     = "2" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<!-- terraform-plan-dev -->